windsinger99/wmc-ctsi-0850-fe-be-app/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define BOARD_INITPINS_IOMUXC_GPR_GPR26_GPIO_MUX1_GPIO_SEL_MASK 0xCF38C000U /*!< GPIO1 and GPIO6 share same IO MUX function, GPIO_MUX1 selects one GPIO function: affected bits mask */
#define BOARD_INITPINS_IOMUXC_GPR_GPR27_GPIO_MUX2_GPIO_SEL_MASK 0x45FF000EU /*!< GPIO2 and GPIO7 share same IO MUX function, GPIO_MUX2 selects one GPIO function: affected bits mask */

/* GPIO_B1_13 (coord D14), WDOG_B */
/* Routed pin properties */
#define BOARD_INITPINS_WDOG_B_PERIPHERAL                                   WDOG1   /*!< Peripheral name */
#define BOARD_INITPINS_WDOG_B_SIGNAL                                      wdog_b   /*!< Signal name */

/* GPIO_AD_B1_06 (coord J12), MUX_ADC1 */
/* Routed pin properties */
#define BOARD_INITPINS_MUX_ADC1_PERIPHERAL                                  ADC1   /*!< Peripheral name */
#define BOARD_INITPINS_MUX_ADC1_SIGNAL                                        IN   /*!< Signal name */
#define BOARD_INITPINS_MUX_ADC1_CHANNEL                                      11U   /*!< Signal channel */

/* GPIO_AD_B1_07 (coord K10), MUX_ADC2 */
/* Routed pin properties */
#define BOARD_INITPINS_MUX_ADC2_PERIPHERAL                                  ADC2   /*!< Peripheral name */
#define BOARD_INITPINS_MUX_ADC2_SIGNAL                                        IN   /*!< Signal name */
#define BOARD_INITPINS_MUX_ADC2_CHANNEL                                      12U   /*!< Signal channel */

/* GPIO_B0_00 (coord D7), MCU_COUPLING_SIG1 */
/* Routed pin properties */
#define BOARD_INITPINS_COUPLING_SIG1_PERIPHERAL                             TMR1   /*!< Peripheral name */
#define BOARD_INITPINS_COUPLING_SIG1_SIGNAL                                TIMER   /*!< Signal name */
#define BOARD_INITPINS_COUPLING_SIG1_CHANNEL                                  0U   /*!< Signal channel */

/* GPIO_AD_B0_02 (coord M11), TMR_TRIG1 */
/* Routed pin properties */
#define BOARD_INITPINS_TMR_TRIG1_PERIPHERAL                                 TMR1   /*!< Peripheral name */
#define BOARD_INITPINS_TMR_TRIG1_SIGNAL                              TIMER_INPUT   /*!< Signal name */
#define BOARD_INITPINS_TMR_TRIG1_CHANNEL                                      1U   /*!< Signal channel */

/* GPIO_B1_09 (coord A13), MCU_LED_CELL_EN */
/* Routed pin properties */
#define BOARD_INITPINS_LED_CELL_EN_PERIPHERAL                               TMR2   /*!< Peripheral name */
#define BOARD_INITPINS_LED_CELL_EN_SIGNAL                                  TIMER   /*!< Signal name */
#define BOARD_INITPINS_LED_CELL_EN_CHANNEL                                    3U   /*!< Signal channel */

/* GPIO_AD_B0_02 (coord M11), TMR_TRIG1 */
/* Routed pin properties */
#define BOARD_INITPINS_TMR_TRIG2_PERIPHERAL                                 TMR2   /*!< Peripheral name */
#define BOARD_INITPINS_TMR_TRIG2_SIGNAL                              TIMER_INPUT   /*!< Signal name */
#define BOARD_INITPINS_TMR_TRIG2_CHANNEL                                      1U   /*!< Signal channel */

/* GPIO_AD_B1_00 (coord J11), MCU_AN_SW_EN1 */
/* Routed pin properties */
#define BOARD_INITPINS_AN_SW_EN1_PERIPHERAL                                 TMR3   /*!< Peripheral name */
#define BOARD_INITPINS_AN_SW_EN1_SIGNAL                                    TIMER   /*!< Signal name */
#define BOARD_INITPINS_AN_SW_EN1_CHANNEL                                      0U   /*!< Signal channel */

/* GPIO_AD_B0_02 (coord M11), TMR_TRIG1 */
/* Routed pin properties */
#define BOARD_INITPINS_TMR_TRIG3_PERIPHERAL                                 TMR3   /*!< Peripheral name */
#define BOARD_INITPINS_TMR_TRIG3_SIGNAL                              TIMER_INPUT   /*!< Signal name */
#define BOARD_INITPINS_TMR_TRIG3_CHANNEL                                      1U   /*!< Signal channel */

/* GPIO_AD_B0_02 (coord M11), TMR_TRIG1 */
/* Routed pin properties */
#define BOARD_INITPINS_TMR_TRIG4_PERIPHERAL                                 TMR4   /*!< Peripheral name */
#define BOARD_INITPINS_TMR_TRIG4_SIGNAL                              TIMER_INPUT   /*!< Signal name */
#define BOARD_INITPINS_TMR_TRIG4_CHANNEL                                      1U   /*!< Signal channel */

/* GPIO_AD_B0_14 (coord H14), MCU_PD_TEST_TRIGGER */
/* Routed pin properties */
#define BOARD_INITPINS_DEBUG_TP1_PERIPHERAL                                GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_DEBUG_TP1_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_DEBUG_TP1_CHANNEL                                     14U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DEBUG_TP1_GPIO                                      GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_DEBUG_TP1_GPIO_PIN                                    14U   /*!< GPIO pin number */
#define BOARD_INITPINS_DEBUG_TP1_GPIO_PIN_MASK                       (1U << 14U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_DEBUG_TP1_PORT                                      GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_DEBUG_TP1_PIN                                         14U   /*!< PORT pin number */
#define BOARD_INITPINS_DEBUG_TP1_PIN_MASK                            (1U << 14U)   /*!< PORT pin mask */

/* GPIO_AD_B0_15 (coord L10), MCU_LED_TEST_TRIGGER */
/* Routed pin properties */
#define BOARD_INITPINS_DEBUG_TP2_PERIPHERAL                                GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_DEBUG_TP2_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_DEBUG_TP2_CHANNEL                                     15U   /*!< Signal channel */

