windsinger99/wmc-ctsi-0850-fe-be-app/board/pin_mux.h
/* GPIO_B1_02 (coord C11), MCU_SINK_DAC_2 */
/* Routed pin properties */
#define BOARD_INITPINS_SINK_DAC_2_PERIPHERAL                               GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_SINK_DAC_2_SIGNAL                                 gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SINK_DAC_2_CHANNEL                                    18U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SINK_DAC_2_GPIO                                     GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SINK_DAC_2_GPIO_PIN                                   18U   /*!< GPIO pin number */
#define BOARD_INITPINS_SINK_DAC_2_GPIO_PIN_MASK                      (1U << 18U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_SINK_DAC_2_PORT                                     GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_SINK_DAC_2_PIN                                        18U   /*!< PORT pin number */
#define BOARD_INITPINS_SINK_DAC_2_PIN_MASK                           (1U << 18U)   /*!< PORT pin mask */

/* GPIO_B1_03 (coord D11), MCU_SINK_DAC_3 */
/* Routed pin properties */
#define BOARD_INITPINS_SINK_DAC_3_PERIPHERAL                               GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_SINK_DAC_3_SIGNAL                                 gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SINK_DAC_3_CHANNEL                                    19U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SINK_DAC_3_GPIO                                     GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SINK_DAC_3_GPIO_PIN                                   19U   /*!< GPIO pin number */
#define BOARD_INITPINS_SINK_DAC_3_GPIO_PIN_MASK                      (1U << 19U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_SINK_DAC_3_PORT                                     GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_SINK_DAC_3_PIN                                        19U   /*!< PORT pin number */
#define BOARD_INITPINS_SINK_DAC_3_PIN_MASK                           (1U << 19U)   /*!< PORT pin mask */

/* GPIO_B1_04 (coord E12), MCU_SINK_DAC_4 */
/* Routed pin properties */
#define BOARD_INITPINS_SINK_DAC_4_PERIPHERAL                               GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_SINK_DAC_4_SIGNAL                                 gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SINK_DAC_4_CHANNEL                                    20U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SINK_DAC_4_GPIO                                     GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SINK_DAC_4_GPIO_PIN                                   20U   /*!< GPIO pin number */
#define BOARD_INITPINS_SINK_DAC_4_GPIO_PIN_MASK                      (1U << 20U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_SINK_DAC_4_PORT                                     GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_SINK_DAC_4_PIN                                        20U   /*!< PORT pin number */
#define BOARD_INITPINS_SINK_DAC_4_PIN_MASK                           (1U << 20U)   /*!< PORT pin mask */

/* GPIO_B1_05 (coord D12), MCU_SINK_DAC_5 */
/* Routed pin properties */
#define BOARD_INITPINS_SINK_DAC_5_PERIPHERAL                               GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_SINK_DAC_5_SIGNAL                                 gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SINK_DAC_5_CHANNEL                                    21U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SINK_DAC_5_GPIO                                     GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SINK_DAC_5_GPIO_PIN                                   21U   /*!< GPIO pin number */
#define BOARD_INITPINS_SINK_DAC_5_GPIO_PIN_MASK                      (1U << 21U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_SINK_DAC_5_PORT                                     GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_SINK_DAC_5_PIN                                        21U   /*!< PORT pin number */
#define BOARD_INITPINS_SINK_DAC_5_PIN_MASK                           (1U << 21U)   /*!< PORT pin mask */

/* GPIO_B1_06 (coord C12), MCU_SINK_DAC_6 */
/* Routed pin properties */
#define BOARD_INITPINS_SINK_DAC_6_PERIPHERAL                               GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_SINK_DAC_6_SIGNAL                                 gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SINK_DAC_6_CHANNEL                                    22U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SINK_DAC_6_GPIO                                     GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SINK_DAC_6_GPIO_PIN                                   22U   /*!< GPIO pin number */
#define BOARD_INITPINS_SINK_DAC_6_GPIO_PIN_MASK                      (1U << 22U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_SINK_DAC_6_PORT                                     GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_SINK_DAC_6_PIN                                        22U   /*!< PORT pin number */
#define BOARD_INITPINS_SINK_DAC_6_PIN_MASK                           (1U << 22U)   /*!< PORT pin mask */

/* GPIO_B1_07 (coord B12), MCU_SINK_DAC_7 */
/* Routed pin properties */
#define BOARD_INITPINS_SINK_DAC_7_PERIPHERAL                               GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_SINK_DAC_7_SIGNAL                                 gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SINK_DAC_7_CHANNEL                                    23U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SINK_DAC_7_GPIO                                     GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SINK_DAC_7_GPIO_PIN                                   23U   /*!< GPIO pin number */
#define BOARD_INITPINS_SINK_DAC_7_GPIO_PIN_MASK                      (1U << 23U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_SINK_DAC_7_PORT                                     GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_SINK_DAC_7_PIN                                        23U   /*!< PORT pin number */
#define BOARD_INITPINS_SINK_DAC_7_PIN_MASK                           (1U << 23U)   /*!< PORT pin mask */

/* GPIO_B1_08 (coord A12), MCU_PD_SHIFT_CLK */
/* Routed pin properties */
#define BOARD_INITPINS_PD_SHIFT_CLK_PERIPHERAL                             GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_PD_SHIFT_CLK_SIGNAL                               gpio_io   /*!< Signal name */
#define BOARD_INITPINS_PD_SHIFT_CLK_CHANNEL                                  24U   /*!< Signal channel */

