windsinger99/wmc-ctsi-0850-fe-be-app/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PD_SHIFT_CLK_GPIO                                   GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_PD_SHIFT_CLK_GPIO_PIN                                 24U   /*!< GPIO pin number */
#define BOARD_INITPINS_PD_SHIFT_CLK_GPIO_PIN_MASK                    (1U << 24U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_PD_SHIFT_CLK_PORT                                   GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_PD_SHIFT_CLK_PIN                                      24U   /*!< PORT pin number */
#define BOARD_INITPINS_PD_SHIFT_CLK_PIN_MASK                         (1U << 24U)   /*!< PORT pin mask */

/* GPIO_B1_10 (coord B13), MCU_LED_GROUP_EN */
/* Routed pin properties */
#define BOARD_INITPINS_LED_GROUP_EN_PERIPHERAL                             GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_LED_GROUP_EN_SIGNAL                               gpio_io   /*!< Signal name */
#define BOARD_INITPINS_LED_GROUP_EN_CHANNEL                                  26U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED_GROUP_EN_GPIO                                   GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_LED_GROUP_EN_GPIO_PIN                                 26U   /*!< GPIO pin number */
#define BOARD_INITPINS_LED_GROUP_EN_GPIO_PIN_MASK                    (1U << 26U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_LED_GROUP_EN_PORT                                   GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_LED_GROUP_EN_PIN                                      26U   /*!< PORT pin number */
#define BOARD_INITPINS_LED_GROUP_EN_PIN_MASK                         (1U << 26U)   /*!< PORT pin mask */

/* GPIO_B1_14 (coord C14), MCU_PD_SHIFT_DATA */
/* Routed pin properties */
#define BOARD_INITPINS_PD_SHIFT_DATA_PERIPHERAL                            GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_PD_SHIFT_DATA_SIGNAL                              gpio_io   /*!< Signal name */
#define BOARD_INITPINS_PD_SHIFT_DATA_CHANNEL                                 30U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PD_SHIFT_DATA_GPIO                                  GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_PD_SHIFT_DATA_GPIO_PIN                                30U   /*!< GPIO pin number */
#define BOARD_INITPINS_PD_SHIFT_DATA_GPIO_PIN_MASK                   (1U << 30U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_PD_SHIFT_DATA_PORT                                  GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_PD_SHIFT_DATA_PIN                                     30U   /*!< PORT pin number */
#define BOARD_INITPINS_PD_SHIFT_DATA_PIN_MASK                        (1U << 30U)   /*!< PORT pin mask */

/* GPIO_B1_11 (coord C13), MCU_LED_GROUP_CLK */
/* Routed pin properties */
#define BOARD_INITPINS_LED_GROUP_CLK_PERIPHERAL                             TMR4   /*!< Peripheral name */
#define BOARD_INITPINS_LED_GROUP_CLK_SIGNAL                                TIMER   /*!< Signal name */
#define BOARD_INITPINS_LED_GROUP_CLK_CHANNEL                                  3U   /*!< Signal channel */

/* GPIO_AD_B1_08 (coord H13), TEST_POINT_1 */
/* Routed pin properties */
#define BOARD_INITPINS_TEST_POINT_1_PERIPHERAL                             GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_TEST_POINT_1_SIGNAL                               gpio_io   /*!< Signal name */
#define BOARD_INITPINS_TEST_POINT_1_CHANNEL                                  24U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_TEST_POINT_1_GPIO                                   GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_TEST_POINT_1_GPIO_PIN                                 24U   /*!< GPIO pin number */
#define BOARD_INITPINS_TEST_POINT_1_GPIO_PIN_MASK                    (1U << 24U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_TEST_POINT_1_PORT                                   GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_TEST_POINT_1_PIN                                      24U   /*!< PORT pin number */
#define BOARD_INITPINS_TEST_POINT_1_PIN_MASK                         (1U << 24U)   /*!< PORT pin mask */

/* GPIO_AD_B1_09 (coord M13), TEST_POINT_2 */
/* Routed pin properties */
#define BOARD_INITPINS_TEST_POINT_2_PERIPHERAL                             GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_TEST_POINT_2_SIGNAL                               gpio_io   /*!< Signal name */
#define BOARD_INITPINS_TEST_POINT_2_CHANNEL                                  25U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_TEST_POINT_2_GPIO                                   GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_TEST_POINT_2_GPIO_PIN                                 25U   /*!< GPIO pin number */
#define BOARD_INITPINS_TEST_POINT_2_GPIO_PIN_MASK                    (1U << 25U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_TEST_POINT_2_PORT                                   GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_TEST_POINT_2_PIN                                      25U   /*!< PORT pin number */
#define BOARD_INITPINS_TEST_POINT_2_PIN_MASK                         (1U << 25U)   /*!< PORT pin mask */

/* GPIO_AD_B1_10 (coord L13), TEST_POINT_3 */
/* Routed pin properties */
#define BOARD_INITPINS_TEST_POINT_3_PERIPHERAL                             GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_TEST_POINT_3_SIGNAL                               gpio_io   /*!< Signal name */
#define BOARD_INITPINS_TEST_POINT_3_CHANNEL                                  26U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_TEST_POINT_3_GPIO                                   GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_TEST_POINT_3_GPIO_PIN                                 26U   /*!< GPIO pin number */
#define BOARD_INITPINS_TEST_POINT_3_GPIO_PIN_MASK                    (1U << 26U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_TEST_POINT_3_PORT                                   GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_TEST_POINT_3_PIN                                      26U   /*!< PORT pin number */
#define BOARD_INITPINS_TEST_POINT_3_PIN_MASK                         (1U << 26U)   /*!< PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/* GPIO_AD_B0_12 (coord K14), UART1_TXD */
/* Routed pin properties */
#define BOARD_INITDEBUG_UART_UART1_TXD_PERIPHERAL                        LPUART1   /*!< Peripheral name */
#define BOARD_INITDEBUG_UART_UART1_TXD_SIGNAL                                 TX   /*!< Signal name */

/* GPIO_AD_B0_13 (coord L14), UART1_RXD */
/* Routed pin properties */
#define BOARD_INITDEBUG_UART_UART1_RXD_PERIPHERAL                        LPUART1   /*!< Peripheral name */
#define BOARD_INITDEBUG_UART_UART1_RXD_SIGNAL                                 RX   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UART(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSDRAM(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCSI(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLCD(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCAN(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitENET(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUSDHC(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitHyperFlash(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
